; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v2 ?v1)
		(pred_4 ?v8)
		(pred_6 ?v7)
		(pred_1 ?v7)
		(pred_2 ?v8 ?v7)
		(pred_3)
		(pred_5 ?v8))

   (:action op_3
       :parameters  (?v5 ?v6)
       :precondition (and (not-eq ?v5 ?v6) 
                          (pred_6 ?v5) (pred_6 ?v6) (pred_1 ?v5))
       :effect (and  (pred_1 ?v6)
		     (not (pred_1 ?v5))))


   (:action op_1
       :parameters (?v3 ?v4)
       :precondition  (and  (pred_4 ?v3) (pred_6 ?v4)
			    (pred_2 ?v3 ?v4) (pred_1 ?v4) (pred_3))
       :effect (and (pred_5 ?v3)
		    (not (pred_2 ?v3 ?v4)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v3  ?v4)
       :precondition  (and  (pred_4 ?v3) (pred_6 ?v4)
			    (pred_5 ?v3) (pred_1 ?v4))
       :effect (and (pred_2 ?v3 ?v4)
		    (pred_3)
		    (not (pred_5 ?v3)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_09 obj_04 obj_02 obj_08 obj_06 obj_03 
          obj_05 obj_01 obj_07 
)
(:init
(pred_6 obj_09)
(pred_6 obj_04)
(pred_6 obj_02)
(pred_6 obj_08)
(pred_6 obj_06)
(pred_6 obj_03)
(pred_4 obj_05)
(pred_4 obj_01)
(pred_4 obj_07)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(pred_3)
(pred_2 obj_05 obj_09)
(pred_2 obj_01 obj_02)
(pred_2 obj_07 obj_09)
(pred_1 obj_08)
)
(:goal
(and
(pred_2 obj_05 obj_04)
(pred_2 obj_01 obj_04)
(pred_2 obj_07 obj_09)
)
)

(:constraints
  (and
    (sometime-before  (pred_2 obj_05 obj_04) (pred_1 obj_02))
    (sometime-before  (pred_2 obj_01 obj_04) (pred_1 obj_09))
  )
)
)

; plan
1. (op_3 obj_08 obj_02)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_02)
   goals met: 1 of 3
2. (op_1 obj_01 obj_02)
   deleted: (pred_2 obj_01 obj_02) (pred_3)
   added: (pred_5 obj_01)
   goals met: 1 of 3
3. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 1 of 3
4. (op_3 obj_04 obj_09)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_09)
   goals met: 1 of 3
5. (op_2 obj_01 obj_09)
   deleted: (pred_5 obj_01)
   added: (pred_2 obj_01 obj_09) (pred_3)
   goals met: 1 of 3
6. (op_1 obj_05 obj_09)
   deleted: (pred_2 obj_05 obj_09) (pred_3)
   added: (pred_5 obj_05)
   goals met: 1 of 3
7. (op_3 obj_09 obj_04)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_04)
   goals met: 1 of 3
8. (op_2 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_2 obj_05 obj_04) (pred_3)
   goals met: 2 of 3
9. (op_3 obj_04 obj_09)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_09)
   goals met: 2 of 3
10. (op_1 obj_01 obj_09)
   deleted: (pred_2 obj_01 obj_09) (pred_3)
   added: (pred_5 obj_01)
   goals met: 2 of 3
11. (op_3 obj_09 obj_04)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_04)
   goals met: 2 of 3
12. (op_2 obj_01 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_2 obj_01 obj_04) (pred_3)
   goals met: 3 of 3
